hostel_ep/app/views/services/show.html.erb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."service_id" = 1
---
    <tbody>
      <% @service.bookings.each do |booking| %>