hostel_ep/app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings"
---
  def index
    @bookings = Booking.all

INSERT INTO "bookings" ("client_id", "room_id", "service_id", "check_in_date", "departure_date", "created_at", "updated_at") VALUES (1, 1, 1, '2025-01-24', '2025-01-30', '2025-01-24 16:07:14.055688', '2025-01-24 16:07:14.055688') RETURNING "id"
---
  def create
    @booking = Booking.new(booking_params)
    if @booking.save

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = 1 LIMIT 1
DELETE FROM "bookings" WHERE "bookings"."id" = 1
---
  def destroy
    @booking = Booking.find(params[:id])
    @booking.destroy

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = 1 LIMIT 1
---
  def set_booking
    @booking = Booking.find(params[:id])