hostel_ep/app/controllers/clients_controller.rb

  def create
    @client = Client.new(client_params)
    if @client.save
---
INSERT INTO "clients" ("last_name_and_initials", "passport", "telephone", "created_at", "updated_at") VALUES ('Миков.Н.С.', '12 34 567890', '89898196286', '2025-01-24 14:58:20.262373', '2025-01-24 14:58:20.262373') RETURNING "id"

  def update
    if @client.update(client_params)
---
UPDATE "clients" SET "telephone" = '+73450987341', "updated_at" = '2025-01-24 15:02:53.609587' WHERE "clients"."id" = 2

  def destroy
    @client = Client.find(params[:id])
    if @client.can_destroy?
      @client.destroy
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 3 LIMIT 1
DELETE FROM "clients" WHERE "clients"."id" = 3