hostel_ep/app/controllers/home_controller.rb

SELECT "bookings".* FROM "bookings"
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (1, 2)
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" IN (1, 2)
SELECT "services".* FROM "services"
---
  def index
    @bookings = Booking.includes(:client, :room, :service).all