hostel_ep/app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)
    if @room.save
---
INSERT INTO "rooms" ("category", "capacity", "price", "created_at", "updated_at") VALUES ('обычный', 1, 2500.0, '2025-01-24 15:26:28.448656', '2025-01-24 15:26:28.448656') RETURNING "id"

  def update
    if @room.update(room_params)
---
UPDATE "rooms" SET "capacity" = 2, "price" = 3000.0, "updated_at" = '2025-01-24 15:29:50.030716' WHERE "rooms"."id" = 2

  def destroy
    @room = Room.find(params[:id])
    if @room.can_destroy?
      @room.destroy
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = 1 LIMIT 1
DELETE FROM "rooms" WHERE "rooms"."id" = 3