hostel_ep/app/controllers/services_controller.rb

  def index
    @services = Service.all
---
SELECT "services".* FROM "services"

  def create
    @service = Service.new(service_params)
    if @service.save
---
INSERT INTO "services" ("title", "price", "created_at", "updated_at") VALUES ('Массаж', 250.0, '2025-01-24 15:41:24.312660', '2025-01-24 15:41:24.312660') RETURNING "id"

  def destroy
    @service = Service.find(params[:id])
    if @service.can_destroy?
      @service.destroy
---
SELECT "services".* FROM "services" WHERE "services"."id" = 1 LIMIT 1
DELETE FROM "services" WHERE "services"."id" = 2

  def set_service
    @service = Service.find(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = 2 LIMIT 1