hostel_ep/app/views/rooms/show.html.erb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."room_id" = 1
---
    <tbody>
      <% @room.bookings.each do |booking| %>