hostel_ep/app/views/clients/show.html.erb

    <tbody>
      <% @client.bookings.each do |booking| %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."client_id" = 2